{
    "class_name": "Sequential",
    "keras_version": "2.2.4",
    "config": {
        "layers": [
            {
                "class_name": "Dense",
                "config": {
                    "kernel_initializer": {
                        "class_name": "RandomUniform",
                        "config": {
                            "maxval": 0.05,
                            "seed": null,
                            "minval": -0.05
                        }
                    },
                    "name": "dense_1",
                    "kernel_constraint": null,
                    "bias_regularizer": null,
                    "bias_constraint": null,
                    "dtype": "float32",
                    "activation": "linear",
                    "trainable": true,
                    "kernel_regularizer": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "units": 10,
                    "batch_input_shape": [
                        null,
                        8
                    ],
                    "use_bias": true,
                    "activity_regularizer": null
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "linear",
                    "trainable": true,
                    "name": "activation_1"
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "scale": 1.0,
                            "seed": null,
                            "mode": "fan_avg"
                        }
                    },
                    "name": "dense_2",
                    "kernel_constraint": null,
                    "bias_regularizer": null,
                    "bias_constraint": null,
                    "activation": "linear",
                    "trainable": true,
                    "kernel_regularizer": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "units": 9,
                    "use_bias": true,
                    "activity_regularizer": null
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "trainable": true,
                    "name": "activation_2"
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "kernel_initializer": {
                        "class_name": "RandomUniform",
                        "config": {
                            "maxval": 0.05,
                            "seed": null,
                            "minval": -0.05
                        }
                    },
                    "name": "dense_3",
                    "kernel_constraint": null,
                    "bias_regularizer": null,
                    "bias_constraint": null,
                    "activation": "linear",
                    "trainable": true,
                    "kernel_regularizer": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "units": 1,
                    "use_bias": true,
                    "activity_regularizer": null
                }
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "linear",
                    "trainable": true,
                    "name": "activation_3"
                }
            }
        ],
        "name": "sequential_1"
    },
    "backend": "tensorflow"
}